/*Даны целые числа 𝑛 и 𝑘, 𝑛 > 1. Напечатать 𝑘 десятичных знаков числа(1\𝑛),используя только целые переменные.*/#include<iostream>using namespace std;int main() {	setlocale(LC_ALL, "rus");	int n, k;	cout << "Введите n\n";	cin >> n;	cout << "Введите k\n";	cin >> k;	for (int i = 0, o = 1; i < k; ++i)	{		o = o * 10;		cout << (o / n);		o %= n;	}}